# -*- coding:utf-8 -*-
'嵌套词典'
import math
Numberlist={
'才冬':{'学号':'1403050202','性别':'男','年龄':19,'成绩信息':90},
'都刚':{'学号':'1403050204','性别':'男','年龄':19,'成绩信息':89},
'富浩东':{'学号':'1403050205','性别':'男','年龄':19,'成绩信息':92},
'葛都城':{'学号':'1403050207','性别':'男','年龄':19,'成绩信息':87},
'郭金':{'学号':'1403050208','性别':'男','年龄':19,'成绩信息':85},
'韩东':{'学号':'1403050209','性别':'男','年龄':20,'成绩信息':88},
'韩峰':{'学号':'1403050210','性别':'男','年龄':19,'成绩信息':86},
'金国君':{'学号':'1403050211','性别':'男','年龄':19,'成绩信息':89},
'冷有振':{'学号':'1403050212','性别':'男','年龄':19,'成绩信息':93},
'李季':{'学号':'1403050213','性别':'男','年龄':19,'成绩信息':96},
'陆永兴':{'学号':'1403050215','性别':'男','年龄':23,'成绩信息':88},
'马骥':{'学号':'1403050216','性别':'男','年龄':19,'成绩信息':89},
'苏垚':{'学号':'1403050217','性别':'男','年龄':19,'成绩信息':91},
'隋云鹏':{'学号':'1403050218','性别':'男','年龄':21,'成绩信息':92.5},
'田宏':{'学号':'1403050219','性别':'男','年龄':21,'成绩信息':98},
'田思维':{'学号':'1403050220','性别':'男','年龄':19,'成绩信息':96},
'王东升':{'学号':'1403050221','性别':'男','年龄':19,'成绩信息':97},
'王坤鹏':{'学号':'1403050222','性别':'男','年龄':19,'成绩信息':99},
'王硕':{'学号':'1403050223','性别':'男','年龄':19,'成绩信息':86},
'王云正':{'学号':'1403050224','性别':'男','年龄':19,'成绩信息':91},
'张夺':{'学号':'1403050225','性别':'男','年龄':19,'成绩信息':98},
'张铭':{'学号':'1403050226','性别':'男','年龄':19,'成绩信息':92.5},
'赵岩':{'学号':'1403050227','性别':'男','年龄':20,'成绩信息':94.5},
'赵洋':{'学号':'1403050228','性别':'男','年龄':19,'成绩信息':91.2},
'朱登科':{'学号':'1403050229','性别':'男','年龄':19,'成绩信息':88.5},
'高峰':{'学号':'1403050206','性别':'男','年龄':19,'成绩信息':98}
}
name={'才冬','都刚','富浩东','葛都城','高峰','郭金','韩东','韩峰','金国君','冷有振','李季','陆永兴','马骥','苏垚',
'隋云鹏','田宏','田思维','王东升','王坤鹏','王硕','王云正','张夺','张铭','赵岩','赵洋','朱登科'}

sex={'男','男','男','男','男','男','男','男','男','男','男','男','男','男','男','男',
'男','男','男','男','男','男','男','男','男','男',}

id={'1403050202','1403050204','1403050205','1403050206','1403050207','1403050208','1403050209',
'1403050210','1403050211','1403050212','1403050213','1403050215','1403050216','1403050217',
'1403050218','1403050219','1403050220','1403050221','1403050222','1403050223','1403050224',
'1403050225','1403050226','1403050227','1403050228','1403050229',}

grde={90,89,92,87,85,88,86,89,93,96,88,89,91,92.5,98,96,97,99,86,91,98,92.5,94.5,91.2,88.5,98}

age={19,19,19,19,19,20,19,19,19,19,23,19,19,21,21,19,19,19,19,19,19,19,20,19,19,19}

n=len(name)

print'欢迎来到通风二班\n本套管理系统可实现以下方面\n 1.增加、删除学生\n 2.显示所有学生的学号、姓名、性别、年龄、成绩信息\
\n 3.修改单个学生的信息\n 4.查找学生\n 5.显示制作人\n 6.统计分析\n 7.退出通风二班信息库'

i=input('请输入需要服务(序号)：')
if i==1:
print'1.1增加学生\n1.2 删除学生'
p=input('请输入服务(序号)：')
if p==1.1；
0=[str(raw-input('姓名：'))]
m=[input('学号:')]
c=[input('年龄:')]
d=[str(raw-input('性别：'))]
e=[float(raw-input('成绩：'))]
name.extend(o)
id.extend(m)
age.extend(c)
sex.extend(d)
grade.extend(e)
n=len(name)
for i in range(n):
print'姓名:%s学号:%r年龄:%r性别:%s成绩:%f'%(name[i],id[i],age[i],sex[i],grade[i],)
elif p= =1.2:
q=[str(raw-input('姓名：'))]
del q
n=len(name)
for i in range(n):
print'姓名:%s学号:%r年龄:%r性别:%s成绩:%f'%(name[i],id[i],age[i],sex[i],grade[i],)
else:
print'输入错误'
elif i==2:
for i in range(n):
print'姓名:%s学号:%d年龄:%d性别:%s成绩:%g'%(name[i],id[i],age[i],sex[i],grade[i],)
elif i==5:
print'使用本系统请输入需要功能序号\n如想联系制作人请来A3-514'
elif i==6:
print'6.1班级人数\n6.2最大最小年龄\n6.3 平均年龄\n6.4最高最低成绩\n6.5平均成绩\n6.6按成绩排序'
a=input('请输入需要服务(序号)：')
if a==6.1:
print'学生人数:',n
elif a==6.2:
print'最大年龄:',max(age),'最小年龄',min(age)
elif a==6.3:
print'平均年龄:',sum(age)/len(age)
elif a==6.4:
print'最高成绩:',max(grade),'最低成绩:',min(grade)
elif a==6.5:
print'平均成绩:',sum(grade)/len(grade)
elif a==6.6:
print'0-0'
else:
print'输入错误'
elif i==7；
print '欢迎下次再来'
else：
print'输入错误'



















